<a href="https://colab.research.google.com/github/thavha/Regression-predict-group-5/blob/master/regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Data Preprocessing**
Importing Liabraries

In [0]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

**Importing the data set** and checking the data

In [0]:
dataset = pd.read_csv('Train.csv')
###x =dataset.iloc[:,:-1].values
###y = dataset.iloc[:,-1].values

In [5]:
dataset.head()

         Order No       User Id  ...      Rider Id  Time from Pickup to Arrival
0   Order_No_4211   User_Id_633  ...  Rider_Id_432                          745
1  Order_No_25375  User_Id_2285  ...  Rider_Id_856                         1993
2   Order_No_1899   User_Id_265  ...  Rider_Id_155                          455
3   Order_No_9336  User_Id_1402  ...  Rider_Id_855                         1341
4  Order_No_27883  User_Id_1737  ...  Rider_Id_770                         1214

[5 rows x 29 columns]

selecting only the rlevent  columns that will be used for the model and replacing white space with _ on columns names

In [0]:
new_df = dataset[['User Id','Platform Type','Personal or Business','Placement - Day of Month','Placement - Weekday (Mo = 1)','Placement - Time','Confirmation - Time','Arrival at Pickup - Time','Arrival at Destination - Time','Distance (KM)','Temperature','Rider Id','Time from Pickup to Arrival']].copy()
new_df.columns = [col.replace(" ","_") for col in new_df.columns]

In [24]:
new_df.head()

        User_Id  Platform_Type  ...      Rider_Id  Time_from_Pickup_to_Arrival
0   User_Id_633              3  ...  Rider_Id_432                          745
1  User_Id_2285              3  ...  Rider_Id_856                         1993
2   User_Id_265              3  ...  Rider_Id_155                          455
3  User_Id_1402              3  ...  Rider_Id_855                         1341
4  User_Id_1737              1  ...  Rider_Id_770                         1214

[5 rows x 13 columns]

encoding personal or business column

In [25]:
new_df = pd.get_dummies(new_df, columns=['Personal_or_Business'], prefix = ['personal'])
new_df = new_df.iloc[:, :-1]
new_df.columns = [*new_df.columns[:-1], 'Business']
new_df.head()

        User_Id  Platform_Type  ...  Time_from_Pickup_to_Arrival  Business
0   User_Id_633              3  ...                          745         1
1  User_Id_2285              3  ...                         1993         0
2   User_Id_265              3  ...                          455         1
3  User_Id_1402              3  ...                         1341         1
4  User_Id_1737              1  ...                         1214         0

[5 rows x 13 columns]

In [26]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21201 entries, 0 to 21200
Data columns (total 13 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   User_Id                        21201 non-null  object
 1   Platform_Type                  21201 non-null  int64
 2   Placement_-_Day_of_Month       21201 non-null  int64
 3   Placement_-_Weekday_(Mo_=_1)   21201 non-null  int64
 4   Placement_-_Time               21201 non-null  object
 5   Confirmation_-_Time            21201 non-null  object
 6   Arrival_at_Pickup_-_Time       21201 non-null  object
 7   Arrival_at_Destination_-_Time  21201 non-null  object
 8   Distance_(KM)                  21201 non-null  int64
 9   Temperature                    16835 non-null  float64
 10  Rider_Id                       21201 non-null  object
 11  Time_from_Pickup_to_Arrival    21201 non-null  int64
 12  Business                       21201 non-null  uint8
dtypes: float64(1), int64(5), object(6), uint8(1)
memory usage: 2.0+ MB

dealing with the missing valuse replace with the mean/median temperature

In [29]:
new_df['Temperature'] = new_df.Temperature.fillna(new_df.Temperature.median())
new_df.head()

        User_Id  Platform_Type  ...  Time_from_Pickup_to_Arrival  Business
0   User_Id_633              3  ...                          745         1
1  User_Id_2285              3  ...                         1993         0
2   User_Id_265              3  ...                          455         1
3  User_Id_1402              3  ...                         1341         1
4  User_Id_1737              1  ...                         1214         0

[5 rows x 13 columns]